zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW235/startup_MCXW235.cpp
//*****************************************************************************
// MCXW235 startup code
//
// Version : 181125
//*****************************************************************************
//
// Copyright 2016-2025 NXP
//
// SPDX-License-Identifier: BSD-3-Clause
//*****************************************************************************
#include <stdint.h>

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC push_options
#pragma GCC optimize("Og")
#endif //(__GNUC__)
#endif //(DEBUG)

#if defined(__cplusplus)
#if defined(__MCUXPRESSO)
#if defined(__REDLIB__)
#error Redlib does not support C++
#else
//*****************************************************************************
//
// The entry point for the C++ library startup
//
//*****************************************************************************
extern "C" {
extern void __libc_init_array(void);
}
#endif //(__REDLIB__)
#endif //(__MCUXPRESSO)
#endif //(__cplusplus)

#define WEAK __attribute__((weak))
#if defined(__MCUXPRESSO)
#define WEAK_AV __attribute__((weak, section(".after_vectors")))
#else
#define WEAK_AV __attribute__((weak))
#endif //(__MCUXPRESSO)
#define ALIAS(f) __attribute__((weak, alias(#f)))

//*****************************************************************************
#if defined(__cplusplus)
extern "C" {
#endif //(__cplusplus)

//*****************************************************************************
// Variable to store CRP value in. Will be placed automatically
// by the linker when "Enable Code Read Protect" selected.
// See crp.h header for more information
//*****************************************************************************
//*****************************************************************************
// Declaration of external SystemInit function
//*****************************************************************************
extern void SystemInit(void);

//*****************************************************************************
// Forward declaration of the core exception handlers.
// When the application defines a handler (with the same name), this will
// automatically take precedence over these weak definitions.
// If your application is a C++ one, then any interrupt handlers defined
// in C++ files within in your main application will need to have C linkage
// rather than C++ linkage. To do this, make sure that you are using extern "C"
// { .... } around the interrupt handler within your main application code.
//*****************************************************************************
#if defined(__MCUXPRESSO)
void ResetISR(void);
#else
void Reset_Handler(void);
#endif //(__MCUXPRESSO)
void Reset_Handler_C(void);
WEAK void NMI_Handler(void);
WEAK void HardFault_Handler(void);
WEAK void MemManage_Handler(void);
WEAK void BusFault_Handler(void);
WEAK void UsageFault_Handler(void);
WEAK void SecureFault_Handler(void);
WEAK void SVC_Handler(void);
WEAK void DebugMon_Handler(void);
WEAK void PendSV_Handler(void);
WEAK void SysTick_Handler(void);
WEAK void DefaultISR(void);

//*****************************************************************************
// Forward declaration of the application IRQ handlers. When the application
// defines a handler (with the same name), this will automatically take
// precedence over weak definitions below
//*****************************************************************************
WEAK void WDT_BOD_IRQHandler(void);
WEAK void DMA0_IRQHandler(void);
WEAK void GINT0_IRQHandler(void);
WEAK void Reserved19_IRQHandler(void);
WEAK void PIN_INT0_IRQHandler(void);
WEAK void PIN_INT1_IRQHandler(void);
WEAK void PIN_INT2_IRQHandler(void);
WEAK void PIN_INT3_IRQHandler(void);
WEAK void UTICK0_IRQHandler(void);
WEAK void MRT0_IRQHandler(void);
WEAK void CTIMER0_IRQHandler(void);
WEAK void CTIMER1_IRQHandler(void);
WEAK void SCT0_IRQHandler(void);
WEAK void CTIMER3_IRQHandler(void);
WEAK void FLEXCOMM0_IRQHandler(void);
WEAK void FLEXCOMM1_IRQHandler(void);
WEAK void FLEXCOMM2_IRQHandler(void);
WEAK void Reserved33_IRQHandler(void);
WEAK void Reserved34_IRQHandler(void);
WEAK void Reserved35_IRQHandler(void);
WEAK void Reserved36_IRQHandler(void);
WEAK void Reserved37_IRQHandler(void);
WEAK void BLE_LL_IRQHandler(void);
WEAK void BLE_SLP_TMR_IRQHandler(void);
WEAK void WDT_IRQHandler(void);
WEAK void Reserved41_IRQHandler(void);
WEAK void Reserved42_IRQHandler(void);
WEAK void BOD1_IRQHandler(void);
WEAK void BOD2_IRQHandler(void);
WEAK void RTC_IRQHandler(void);
WEAK void Reserved46_IRQHandler(void);
WEAK void WAKE_DSLP_IRQHandler(void);
WEAK void PIN_INT4_IRQHandler(void);
WEAK void PIN_INT5_IRQHandler(void);
WEAK void PIN_INT6_IRQHandler(void);
WEAK void PIN_INT7_IRQHandler(void);
WEAK void CTIMER2_IRQHandler(void);
WEAK void CTIMER4_IRQHandler(void);
WEAK void OS_EVENT_IRQHandler(void);
WEAK void SPIFI_IRQHandler(void);
WEAK void Reserved56_IRQHandler(void);
WEAK void Reserved57_IRQHandler(void);
WEAK void Reserved58_IRQHandler(void);
WEAK void FLASH_CCIF_IRQHandler(void);
WEAK void FLASH_DFIF_IRQHandler(void);
WEAK void Reserved61_IRQHandler(void);
WEAK void Reserved62_IRQHandler(void);
WEAK void Reserved63_IRQHandler(void);
WEAK void Reserved64_IRQHandler(void);
WEAK void SEC_HYPERVISOR_CALL_IRQHandler(void);
WEAK void SEC_GPIO_INT0_IRQ0_IRQHandler(void);
WEAK void SEC_GPIO_INT0_IRQ1_IRQHandler(void);
WEAK void PLU_IRQHandler(void);
WEAK void SEC_VIO_IRQHandler(void);
WEAK void HASHCRYPT_IRQHandler(void);
WEAK void CASPER_IRQHandler(void);
WEAK void PUF_IRQHandler(void);
WEAK void TRNG_IRQHandler(void);
WEAK void DMA1_IRQHandler(void);
WEAK void Reserved75_IRQHandler(void);
WEAK void CDOG_IRQHandler(void);
WEAK void Reserved77_IRQHandler(void);
WEAK void Reserved78_IRQHandler(void);
WEAK void WAKE_PAD_IRQHandler(void);

//*****************************************************************************
// Forward declaration of the driver IRQ handlers. These are aliased
// to the DefaultISR, which is a 'forever' loop. When the driver
// defines a handler (with the same name), this will automatically take
// precedence over these weak definitions
//*****************************************************************************
void WDT_BOD_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA0_DriverIRQHandler(void) ALIAS(DefaultISR);
void GINT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved19_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT2_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT3_DriverIRQHandler(void) ALIAS(DefaultISR);
void UTICK0_DriverIRQHandler(void) ALIAS(DefaultISR);
void MRT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER1_DriverIRQHandler(void) ALIAS(DefaultISR);
void SCT0_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER3_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCOMM0_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCOMM1_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLEXCOMM2_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved33_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved34_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved35_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved36_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved37_DriverIRQHandler(void) ALIAS(DefaultISR);
void BLE_LL_DriverIRQHandler(void) ALIAS(DefaultISR);
void BLE_SLP_TMR_DriverIRQHandler(void) ALIAS(DefaultISR);
void WDT_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved41_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved42_DriverIRQHandler(void) ALIAS(DefaultISR);
void BOD1_DriverIRQHandler(void) ALIAS(DefaultISR);
void BOD2_DriverIRQHandler(void) ALIAS(DefaultISR);
void RTC_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved46_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_DSLP_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT4_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT5_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT6_DriverIRQHandler(void) ALIAS(DefaultISR);
void PIN_INT7_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER2_DriverIRQHandler(void) ALIAS(DefaultISR);
void CTIMER4_DriverIRQHandler(void) ALIAS(DefaultISR);
void OS_EVENT_DriverIRQHandler(void) ALIAS(DefaultISR);
void SPIFI_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved56_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved57_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved58_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_CCIF_DriverIRQHandler(void) ALIAS(DefaultISR);
void FLASH_DFIF_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved61_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved62_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved63_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved64_DriverIRQHandler(void) ALIAS(DefaultISR);
void SEC_HYPERVISOR_CALL_DriverIRQHandler(void) ALIAS(DefaultISR);
void SEC_GPIO_INT0_IRQ0_DriverIRQHandler(void) ALIAS(DefaultISR);
void SEC_GPIO_INT0_IRQ1_DriverIRQHandler(void) ALIAS(DefaultISR);
void PLU_DriverIRQHandler(void) ALIAS(DefaultISR);
void SEC_VIO_DriverIRQHandler(void) ALIAS(DefaultISR);
void HASHCRYPT_DriverIRQHandler(void) ALIAS(DefaultISR);
void CASPER_DriverIRQHandler(void) ALIAS(DefaultISR);
void PUF_DriverIRQHandler(void) ALIAS(DefaultISR);
void TRNG_DriverIRQHandler(void) ALIAS(DefaultISR);
void DMA1_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved75_DriverIRQHandler(void) ALIAS(DefaultISR);
void CDOG_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved77_DriverIRQHandler(void) ALIAS(DefaultISR);
void Reserved78_DriverIRQHandler(void) ALIAS(DefaultISR);
void WAKE_PAD_DriverIRQHandler(void) ALIAS(DefaultISR);

//*****************************************************************************
// The entry point for the application.
// __main() is the entry point for Redlib based applications
// main() is the entry point for Newlib based applications
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void __main(void);
#elif defined(__MCUXPRESSO)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern int main(void);
#endif //(__REDLIB__)
#elif defined(__ICCARM__)
extern void __iar_program_start(void);
#elif defined(__GNUC__)
#if defined(__REDLIB__)
extern void __main(void);
#else
extern void _start(void);
#endif //(__REDLIB__)
#else
#error Unsupported toolchain!
#endif //(__MCUXPRESSO)

//*****************************************************************************
// External declaration for the pointer from the Linker Script
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Base[];
extern uint32_t Image$$ARM_LIB_STACK$$ZI$$Limit[];
#define _vStackTop  Image$$ARM_LIB_STACK$$ZI$$Limit
#define _vStackBase Image$$ARM_LIB_STACK$$ZI$$Base
#elif defined(__MCUXPRESSO)
extern void _vStackTop(void);
extern void _vStackBase(void);
#define Reset_Handler ResetISR // To be compatible with other compilers
#elif defined(__ICCARM__)
#pragma segment = "CSTACK"
#define _vStackTop  __section_end("CSTACK")
#define _vStackBase __section_begin("CSTACK")
#elif defined(__GNUC__)
extern uint32_t __StackTop[];
extern uint32_t __StackLimit[];

