zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW235/startup_MCXW235.cpp
#define _vStackTop  __StackTop
#define _vStackBase __StackLimit

extern uint32_t __etext[];
extern uint32_t __data_start__[];
extern uint32_t __data_end__[];

extern uint32_t __bss_start__[];
extern uint32_t __bss_end__[];
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)

//*****************************************************************************
#if defined(__cplusplus)
} // extern "C"
#endif //(__cplusplus)
//*****************************************************************************
// The vector table.
// This relies on the linker script to place at correct location in memory.
//*****************************************************************************
#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
extern void (*const __Vectors[])(void);
#define __vector_table __Vectors
__attribute__((used, section(".isr_vector"))) void (*const __Vectors[])(void) = {
#elif defined(__MCUXPRESSO)
extern void (*const g_pfnVectors[])(void);
extern void *__Vectors __attribute__((alias("g_pfnVectors")));
#define __vector_table g_pfnVectors
__attribute__((used, section(".isr_vector"))) void (*const g_pfnVectors[])(void) = {
#elif defined(__ICCARM__)
extern void (*const __vector_table[])(void);
/* The vector table is not needed for initialization. */
extern void (*const __iar_init$$done[])(void) __attribute__((alias("__vector_table")));
__attribute__((used, section(".intvec"))) void (*const __vector_table[])(void) = {
#elif defined(__GNUC__)
extern void (*const __isr_vector[])(void);
#define __vector_table __isr_vector
__attribute__((used, section(".isr_vector"))) void (*const __isr_vector[])(void) = {
#else
#error Unsupported toolchain!
#endif //(__CC_ARM) || (__ARMCC_VERSION)
    // Core Level - CM33
    (void (*)())((uint32_t)_vStackTop), // The initial stack pointer
    Reset_Handler,                      // The reset handler

    NMI_Handler,                        // NMI Handler
    HardFault_Handler,                  // Hard Fault Handler
    MemManage_Handler,                  // MPU Fault Handler
    BusFault_Handler,                   // Bus Fault Handler
    UsageFault_Handler,                 // Usage Fault Handler
    SecureFault_Handler,                // Secure Fault Handler
    0,                                  // Reserved
    0,                                  // Reserved
    0,                                  // Reserved
    SVC_Handler,                        // SVCall Handler
    DebugMon_Handler,                   // Debug Monitor Handler
    0,                                  // Reserved
    PendSV_Handler,                     // PendSV Handler
    SysTick_Handler,                    // SysTick Handler

    // Chip Level - MCXW235
    WDT_BOD_IRQHandler,             // 16: Windowed watchdog timer, Brownout detect, Flash interrupt
    DMA0_IRQHandler,                // 17: DMA0 controller
    GINT0_IRQHandler,               // 18: GPIO group 0
    Reserved19_IRQHandler,          // 19: Reserved interrupt
    PIN_INT0_IRQHandler,            // 20: Pin interrupt 0 or pattern match engine slice 0
    PIN_INT1_IRQHandler,            // 21: Pin interrupt 1or pattern match engine slice 1
    PIN_INT2_IRQHandler,            // 22: Pin interrupt 2 or pattern match engine slice 2
    PIN_INT3_IRQHandler,            // 23: Pin interrupt 3 or pattern match engine slice 3
    UTICK0_IRQHandler,              // 24: Micro-tick Timer
    MRT0_IRQHandler,                // 25: Multi-rate timer
    CTIMER0_IRQHandler,             // 26: Standard counter/timer CTIMER0
    CTIMER1_IRQHandler,             // 27: Standard counter/timer CTIMER1
    SCT0_IRQHandler,                // 28: SCTimer/PWM
    CTIMER3_IRQHandler,             // 29: Standard counter/timer CTIMER3
    FLEXCOMM0_IRQHandler,           // 30: Flexcomm Interface 0 (USART, SPI, I2C, FLEXCOMM)
    FLEXCOMM1_IRQHandler,           // 31: Flexcomm Interface 1 (USART, SPI, I2C, FLEXCOMM)
    FLEXCOMM2_IRQHandler,           // 32: Flexcomm Interface 2 (USART, SPI, I2C, FLEXCOMM)
    Reserved33_IRQHandler,          // 33: Reserved interrupt
    Reserved34_IRQHandler,          // 34: Reserved interrupt
    Reserved35_IRQHandler,          // 35: Reserved interrupt
    Reserved36_IRQHandler,          // 36: Reserved interrupt
    Reserved37_IRQHandler,          // 37: Reserved interrupt
    BLE_LL_IRQHandler,              // 38: BLE Link Layer interrupt
    BLE_SLP_TMR_IRQHandler,         // 39: BLE Sleep Timer interrupt
    WDT_IRQHandler,                 // 40: Windowed Watchdog interrupt
    Reserved41_IRQHandler,          // 41: Reserved interrupt
    Reserved42_IRQHandler,          // 42: Reserved interrupt
    BOD1_IRQHandler,                // 43: Brown-out detector 1 interrupt
    BOD2_IRQHandler,                // 44: Brown-out detector 2 interrupt
    RTC_IRQHandler,                 // 45: RTC alarm and wake-up interrupts
    Reserved46_IRQHandler,          // 46: Reserved interrupt
    WAKE_DSLP_IRQHandler,           // 47: Wakeup from deepsleep interrupt
    PIN_INT4_IRQHandler,            // 48: Pin interrupt 4 or pattern match engine slice 4 int
    PIN_INT5_IRQHandler,            // 49: Pin interrupt 5 or pattern match engine slice 5 int
    PIN_INT6_IRQHandler,            // 50: Pin interrupt 6 or pattern match engine slice 6 int
    PIN_INT7_IRQHandler,            // 51: Pin interrupt 7 or pattern match engine slice 7 int
    CTIMER2_IRQHandler,             // 52: Standard counter/timer CTIMER2
    CTIMER4_IRQHandler,             // 53: Standard counter/timer CTIMER4
    OS_EVENT_IRQHandler,            // 54: OS_EVENT_TIMER and OS_EVENT_WAKEUP interrupts
    SPIFI_IRQHandler,               // 55: QuadSPI Flash interface interrupt
    Reserved56_IRQHandler,          // 56: Reserved interrupt
    Reserved57_IRQHandler,          // 57: Reserved interrupt
    Reserved58_IRQHandler,          // 58: Reserved interrupt
    FLASH_CCIF_IRQHandler,          // 59: Flash command complete interrupt
    FLASH_DFIF_IRQHandler,          // 60: Flash ECC double-bit error detect interrupt
    Reserved61_IRQHandler,          // 61: Reserved interrupt
    Reserved62_IRQHandler,          // 62: Reserved interrupt
    Reserved63_IRQHandler,          // 63: Reserved interrupt
    Reserved64_IRQHandler,          // 64: Reserved interrupt
    SEC_HYPERVISOR_CALL_IRQHandler, // 65: SEC_HYPERVISOR_CALL interrupt
    SEC_GPIO_INT0_IRQ0_IRQHandler,  // 66: SEC_GPIO_INT0_IRQ0 interrupt
    SEC_GPIO_INT0_IRQ1_IRQHandler,  // 67: SEC_GPIO_INT0_IRQ1 interrupt
    PLU_IRQHandler,                 // 68: PLU interrupt
    SEC_VIO_IRQHandler,             // 69: SEC_VIO interrupt
    HASHCRYPT_IRQHandler,           // 70: SHA interrupt
    CASPER_IRQHandler,              // 71: CASPER interrupt
    PUF_IRQHandler,                 // 72: PUF interrupt
    TRNG_IRQHandler,                // 73: TRNG interrupt
    DMA1_IRQHandler,                // 74: DMA1 interrupt
    Reserved75_IRQHandler,          // 75: Reserved interrupt
    CDOG_IRQHandler,                // 76: CDOG interrupt
    Reserved77_IRQHandler,          // 77: Reserved interrupt
    Reserved78_IRQHandler,          // 78: Reserved interrupt
    WAKE_PAD_IRQHandler,            // 79: Wakeup from pin interrupt
};                                     /* End of __vector_table */

#if defined(__MCUXPRESSO)
#if defined(ENABLE_RAM_VECTOR_TABLE)
extern void *__VECTOR_TABLE __attribute__((alias("g_pfnVectors")));
void (*__VECTOR_RAM[sizeof(g_pfnVectors) / 4])(void) __attribute__((aligned(128)));
unsigned int __RAM_VECTOR_TABLE_SIZE_BYTES = sizeof(g_pfnVectors);
#endif //(ENABLE_RAM_VECTOR_TABLE)

//*****************************************************************************
// Functions to carry out the initialization of RW and BSS data sections. These
// are written as separate functions rather than being inlined within the
// ResetISR() function in order to cope with MCUs with multiple banks of
// memory.
//*****************************************************************************
__attribute__((section(".after_vectors.init_data"))) void data_init(unsigned int romstart,
                                                                    unsigned int start,
                                                                    unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int *pulSrc  = (unsigned int *)romstart;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = *pulSrc++;
}

__attribute__((section(".after_vectors.init_bss"))) void bss_init(unsigned int start, unsigned int len)
{
    unsigned int *pulDest = (unsigned int *)start;
    unsigned int loop;
    for (loop = 0; loop < len; loop = loop + 4)
        *pulDest++ = 0;
}

//*****************************************************************************
// The following symbols are constructs generated by the linker, indicating
// the location of various points in the "Global Section Table". This table is
// created by the linker via the Code Red managed linker script mechanism. It
// contains the load address, execution address and length of each RW data
// section and the execution and length of each BSS (zero initialized) section.
//*****************************************************************************
extern unsigned int __data_section_table;
extern unsigned int __data_section_table_end;
extern unsigned int __bss_section_table;
extern unsigned int __bss_section_table_end;
#endif //(__MCUXPRESSO)

//*****************************************************************************
// Reset entry point for your code.
// Sets up a simple runtime environment and initializes the C/C++
// library.
//*****************************************************************************
void Reset_Handler_C(void)
{
#if !defined(__NO_SYSTEM_INIT)
    SystemInit();
#endif //(__NO_SYSTEM_INIT)

